zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz66/include/component/qei.h
/* -------- QEI_QQEIIOCCLR : (QEI Offset: 0x14) (R/W 32) Bit clear register -------- */
#define QEI_QQEIIOCCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_QQEIIOCCLR) Bit clear register  Reset Value */

#define QEI_QQEIIOCCLR_Msk                    _UINT32_(0x00000000)                                 /* (QEI_QQEIIOCCLR) Register Mask  */


/* -------- QEI_QEIIOCSET : (QEI Offset: 0x18) (R/W 32) Bit set register -------- */
#define QEI_QEIIOCSET_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_QEIIOCSET) Bit set register  Reset Value */

#define QEI_QEIIOCSET_Msk                     _UINT32_(0x00000000)                                 /* (QEI_QEIIOCSET) Register Mask  */


/* -------- QEI_QEIIOCINV : (QEI Offset: 0x1C) (R/W 32) Bit invert register -------- */
#define QEI_QEIIOCINV_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_QEIIOCINV) Bit invert register  Reset Value */

#define QEI_QEIIOCINV_Msk                     _UINT32_(0x00000000)                                 /* (QEI_QEIIOCINV) Register Mask  */


/* -------- QEI_QEISTAT : (QEI Offset: 0x20) (R/W 32) QEI Status Register -------- */
#define QEI_QEISTAT_IDXIEN_Pos                _UINT32_(0)                                          /* (QEI_QEISTAT) Index Input Event Interrupt Enable bit Position */
#define QEI_QEISTAT_IDXIEN_Msk                (_UINT32_(0x1) << QEI_QEISTAT_IDXIEN_Pos)            /* (QEI_QEISTAT) Index Input Event Interrupt Enable bit Mask */
#define QEI_QEISTAT_IDXIEN(value)             (QEI_QEISTAT_IDXIEN_Msk & (_UINT32_(value) << QEI_QEISTAT_IDXIEN_Pos)) /* Assignment of value for IDXIEN in the QEI_QEISTAT register */
#define   QEI_QEISTAT_IDXIEN_ON_Val           _UINT32_(0x1)                                        /* (QEI_QEISTAT) Interrupt is enabled  */
#define   QEI_QEISTAT_IDXIEN_OFF_Val          _UINT32_(0x0)                                        /* (QEI_QEISTAT) Interrupt is disabled  */
#define QEI_QEISTAT_IDXIEN_ON                 (QEI_QEISTAT_IDXIEN_ON_Val << QEI_QEISTAT_IDXIEN_Pos) /* (QEI_QEISTAT) Interrupt is enabled Position */
#define QEI_QEISTAT_IDXIEN_OFF                (QEI_QEISTAT_IDXIEN_OFF_Val << QEI_QEISTAT_IDXIEN_Pos) /* (QEI_QEISTAT) Interrupt is disabled Position */
#define QEI_QEISTAT_IDXIRQ_Pos                _UINT32_(1)                                          /* (QEI_QEISTAT) Status Flag for Index Event Status bit Position */
#define QEI_QEISTAT_IDXIRQ_Msk                (_UINT32_(0x1) << QEI_QEISTAT_IDXIRQ_Pos)            /* (QEI_QEISTAT) Status Flag for Index Event Status bit Mask */
#define QEI_QEISTAT_IDXIRQ(value)             (QEI_QEISTAT_IDXIRQ_Msk & (_UINT32_(value) << QEI_QEISTAT_IDXIRQ_Pos)) /* Assignment of value for IDXIRQ in the QEI_QEISTAT register */
#define   QEI_QEISTAT_IDXIRQ_ON_Val           _UINT32_(0x1)                                        /* (QEI_QEISTAT) Index event has occurred  */
#define   QEI_QEISTAT_IDXIRQ_OFF_Val          _UINT32_(0x0)                                        /* (QEI_QEISTAT) No Index event has occurred  */
#define QEI_QEISTAT_IDXIRQ_ON                 (QEI_QEISTAT_IDXIRQ_ON_Val << QEI_QEISTAT_IDXIRQ_Pos) /* (QEI_QEISTAT) Index event has occurred Position */
#define QEI_QEISTAT_IDXIRQ_OFF                (QEI_QEISTAT_IDXIRQ_OFF_Val << QEI_QEISTAT_IDXIRQ_Pos) /* (QEI_QEISTAT) No Index event has occurred Position */
#define QEI_QEISTAT_HOMIEN_Pos                _UINT32_(2)                                          /* (QEI_QEISTAT) Home Input Event Interrupt Enable bit Position */
#define QEI_QEISTAT_HOMIEN_Msk                (_UINT32_(0x1) << QEI_QEISTAT_HOMIEN_Pos)            /* (QEI_QEISTAT) Home Input Event Interrupt Enable bit Mask */
#define QEI_QEISTAT_HOMIEN(value)             (QEI_QEISTAT_HOMIEN_Msk & (_UINT32_(value) << QEI_QEISTAT_HOMIEN_Pos)) /* Assignment of value for HOMIEN in the QEI_QEISTAT register */
#define   QEI_QEISTAT_HOMIEN_ON_Val           _UINT32_(0x1)                                        /* (QEI_QEISTAT) Interrupt is enabled  */
#define   QEI_QEISTAT_HOMIEN_OFF_Val          _UINT32_(0x0)                                        /* (QEI_QEISTAT) Interrupt is disabled  */
#define QEI_QEISTAT_HOMIEN_ON                 (QEI_QEISTAT_HOMIEN_ON_Val << QEI_QEISTAT_HOMIEN_Pos) /* (QEI_QEISTAT) Interrupt is enabled Position */
#define QEI_QEISTAT_HOMIEN_OFF                (QEI_QEISTAT_HOMIEN_OFF_Val << QEI_QEISTAT_HOMIEN_Pos) /* (QEI_QEISTAT) Interrupt is disabled Position */
#define QEI_QEISTAT_HOMIRQ_Pos                _UINT32_(3)                                          /* (QEI_QEISTAT) Status Flag for Home Event Status bit Position */
#define QEI_QEISTAT_HOMIRQ_Msk                (_UINT32_(0x1) << QEI_QEISTAT_HOMIRQ_Pos)            /* (QEI_QEISTAT) Status Flag for Home Event Status bit Mask */
#define QEI_QEISTAT_HOMIRQ(value)             (QEI_QEISTAT_HOMIRQ_Msk & (_UINT32_(value) << QEI_QEISTAT_HOMIRQ_Pos)) /* Assignment of value for HOMIRQ in the QEI_QEISTAT register */
#define   QEI_QEISTAT_HOMIRQ_ON_Val           _UINT32_(0x1)                                        /* (QEI_QEISTAT) Home event has occurred  */
#define   QEI_QEISTAT_HOMIRQ_OFF_Val          _UINT32_(0x0)                                        /* (QEI_QEISTAT) No Home event has occurred  */
#define QEI_QEISTAT_HOMIRQ_ON                 (QEI_QEISTAT_HOMIRQ_ON_Val << QEI_QEISTAT_HOMIRQ_Pos) /* (QEI_QEISTAT) Home event has occurred Position */
#define QEI_QEISTAT_HOMIRQ_OFF                (QEI_QEISTAT_HOMIRQ_OFF_Val << QEI_QEISTAT_HOMIRQ_Pos) /* (QEI_QEISTAT) No Home event has occurred Position */
#define QEI_QEISTAT_VELOVIEN_Pos              _UINT32_(4)                                          /* (QEI_QEISTAT) Velocity Counter Overflow Interrupt Enable bit Position */
#define QEI_QEISTAT_VELOVIEN_Msk              (_UINT32_(0x1) << QEI_QEISTAT_VELOVIEN_Pos)          /* (QEI_QEISTAT) Velocity Counter Overflow Interrupt Enable bit Mask */
#define QEI_QEISTAT_VELOVIEN(value)           (QEI_QEISTAT_VELOVIEN_Msk & (_UINT32_(value) << QEI_QEISTAT_VELOVIEN_Pos)) /* Assignment of value for VELOVIEN in the QEI_QEISTAT register */
#define   QEI_QEISTAT_VELOVIEN_ON_Val         _UINT32_(0x1)                                        /* (QEI_QEISTAT) Interrupt is enabled  */
#define   QEI_QEISTAT_VELOVIEN_OFF_Val        _UINT32_(0x0)                                        /* (QEI_QEISTAT) Interrupt is disabled  */
#define QEI_QEISTAT_VELOVIEN_ON               (QEI_QEISTAT_VELOVIEN_ON_Val << QEI_QEISTAT_VELOVIEN_Pos) /* (QEI_QEISTAT) Interrupt is enabled Position */
#define QEI_QEISTAT_VELOVIEN_OFF              (QEI_QEISTAT_VELOVIEN_OFF_Val << QEI_QEISTAT_VELOVIEN_Pos) /* (QEI_QEISTAT) Interrupt is disabled Position */
#define QEI_QEISTAT_VELOVIRQ_Pos              _UINT32_(5)                                          /* (QEI_QEISTAT) Velocity Counter Overflow Status bit Position */
#define QEI_QEISTAT_VELOVIRQ_Msk              (_UINT32_(0x1) << QEI_QEISTAT_VELOVIRQ_Pos)          /* (QEI_QEISTAT) Velocity Counter Overflow Status bit Mask */
#define QEI_QEISTAT_VELOVIRQ(value)           (QEI_QEISTAT_VELOVIRQ_Msk & (_UINT32_(value) << QEI_QEISTAT_VELOVIRQ_Pos)) /* Assignment of value for VELOVIRQ in the QEI_QEISTAT register */
#define   QEI_QEISTAT_VELOVIRQ_OVERFLOW_Val   _UINT32_(0x1)                                        /* (QEI_QEISTAT) Overflow has occurred  */
#define   QEI_QEISTAT_VELOVIRQ_NO_OVERFLOW_Val _UINT32_(0x0)                                        /* (QEI_QEISTAT) No overflow has not occurred  */
#define QEI_QEISTAT_VELOVIRQ_OVERFLOW         (QEI_QEISTAT_VELOVIRQ_OVERFLOW_Val << QEI_QEISTAT_VELOVIRQ_Pos) /* (QEI_QEISTAT) Overflow has occurred Position */
#define QEI_QEISTAT_VELOVIRQ_NO_OVERFLOW      (QEI_QEISTAT_VELOVIRQ_NO_OVERFLOW_Val << QEI_QEISTAT_VELOVIRQ_Pos) /* (QEI_QEISTAT) No overflow has not occurred Position */
#define QEI_QEISTAT_PCIIEN_Pos                _UINT32_(6)                                          /* (QEI_QEISTAT) Position Counter Initialization Process Complete Interrupt Enable bit Position */
#define QEI_QEISTAT_PCIIEN_Msk                (_UINT32_(0x1) << QEI_QEISTAT_PCIIEN_Pos)            /* (QEI_QEISTAT) Position Counter Initialization Process Complete Interrupt Enable bit Mask */
#define QEI_QEISTAT_PCIIEN(value)             (QEI_QEISTAT_PCIIEN_Msk & (_UINT32_(value) << QEI_QEISTAT_PCIIEN_Pos)) /* Assignment of value for PCIIEN in the QEI_QEISTAT register */
#define   QEI_QEISTAT_PCIIEN_ON_Val           _UINT32_(0x1)                                        /* (QEI_QEISTAT) Interrupt is enabled  */
#define   QEI_QEISTAT_PCIIEN_OFF_Val          _UINT32_(0x0)                                        /* (QEI_QEISTAT) Interrupt is disabled  */
#define QEI_QEISTAT_PCIIEN_ON                 (QEI_QEISTAT_PCIIEN_ON_Val << QEI_QEISTAT_PCIIEN_Pos) /* (QEI_QEISTAT) Interrupt is enabled Position */
#define QEI_QEISTAT_PCIIEN_OFF                (QEI_QEISTAT_PCIIEN_OFF_Val << QEI_QEISTAT_PCIIEN_Pos) /* (QEI_QEISTAT) Interrupt is disabled Position */
#define QEI_QEISTAT_PCIIRQ_Pos                _UINT32_(7)                                          /* (QEI_QEISTAT) Position Counter Initialization Process Complete Status bit Position */
#define QEI_QEISTAT_PCIIRQ_Msk                (_UINT32_(0x1) << QEI_QEISTAT_PCIIRQ_Pos)            /* (QEI_QEISTAT) Position Counter Initialization Process Complete Status bit Mask */
#define QEI_QEISTAT_PCIIRQ(value)             (QEI_QEISTAT_PCIIRQ_Msk & (_UINT32_(value) << QEI_QEISTAT_PCIIRQ_Pos)) /* Assignment of value for PCIIRQ in the QEI_QEISTAT register */
#define   QEI_QEISTAT_PCIIRQ_DONE_Val         _UINT32_(0x1)                                        /* (QEI_QEISTAT) POSxCNT was reinitialized  */
#define   QEI_QEISTAT_PCIIRQ_NOT_DONE_Val     _UINT32_(0x0)                                        /* (QEI_QEISTAT) POSxCNT was not reinitialized  */
#define QEI_QEISTAT_PCIIRQ_DONE               (QEI_QEISTAT_PCIIRQ_DONE_Val << QEI_QEISTAT_PCIIRQ_Pos) /* (QEI_QEISTAT) POSxCNT was reinitialized Position */
#define QEI_QEISTAT_PCIIRQ_NOT_DONE           (QEI_QEISTAT_PCIIRQ_NOT_DONE_Val << QEI_QEISTAT_PCIIRQ_Pos) /* (QEI_QEISTAT) POSxCNT was not reinitialized Position */
#define QEI_QEISTAT_POSOVIEN_Pos              _UINT32_(8)                                          /* (QEI_QEISTAT) Position Counter Overflow Interrupt Enable bit Position */
#define QEI_QEISTAT_POSOVIEN_Msk              (_UINT32_(0x1) << QEI_QEISTAT_POSOVIEN_Pos)          /* (QEI_QEISTAT) Position Counter Overflow Interrupt Enable bit Mask */
#define QEI_QEISTAT_POSOVIEN(value)           (QEI_QEISTAT_POSOVIEN_Msk & (_UINT32_(value) << QEI_QEISTAT_POSOVIEN_Pos)) /* Assignment of value for POSOVIEN in the QEI_QEISTAT register */
#define   QEI_QEISTAT_POSOVIEN_ON_Val         _UINT32_(0x1)                                        /* (QEI_QEISTAT) Interrupt is enabled  */
#define   QEI_QEISTAT_POSOVIEN_OFF_Val        _UINT32_(0x0)                                        /* (QEI_QEISTAT) Interrupt is disabled  */
#define QEI_QEISTAT_POSOVIEN_ON               (QEI_QEISTAT_POSOVIEN_ON_Val << QEI_QEISTAT_POSOVIEN_Pos) /* (QEI_QEISTAT) Interrupt is enabled Position */
#define QEI_QEISTAT_POSOVIEN_OFF              (QEI_QEISTAT_POSOVIEN_OFF_Val << QEI_QEISTAT_POSOVIEN_Pos) /* (QEI_QEISTAT) Interrupt is disabled Position */
#define QEI_QEISTAT_POSOVIRQ_Pos              _UINT32_(9)                                          /* (QEI_QEISTAT) Position Counter Overflow Status bit Position */
#define QEI_QEISTAT_POSOVIRQ_Msk              (_UINT32_(0x1) << QEI_QEISTAT_POSOVIRQ_Pos)          /* (QEI_QEISTAT) Position Counter Overflow Status bit Mask */
#define QEI_QEISTAT_POSOVIRQ(value)           (QEI_QEISTAT_POSOVIRQ_Msk & (_UINT32_(value) << QEI_QEISTAT_POSOVIRQ_Pos)) /* Assignment of value for POSOVIRQ in the QEI_QEISTAT register */
#define   QEI_QEISTAT_POSOVIRQ_OVERFLOW_Val   _UINT32_(0x1)                                        /* (QEI_QEISTAT) Overflow has occurred  */
#define   QEI_QEISTAT_POSOVIRQ_NO_OVERFLOW_Val _UINT32_(0x0)                                        /* (QEI_QEISTAT) No overflow has occurred  */
#define QEI_QEISTAT_POSOVIRQ_OVERFLOW         (QEI_QEISTAT_POSOVIRQ_OVERFLOW_Val << QEI_QEISTAT_POSOVIRQ_Pos) /* (QEI_QEISTAT) Overflow has occurred Position */
#define QEI_QEISTAT_POSOVIRQ_NO_OVERFLOW      (QEI_QEISTAT_POSOVIRQ_NO_OVERFLOW_Val << QEI_QEISTAT_POSOVIRQ_Pos) /* (QEI_QEISTAT) No overflow has occurred Position */
#define QEI_QEISTAT_PCLEQIEN_Pos              _UINT32_(10)                                         /* (QEI_QEISTAT) Position Counter Less Than or Equal Compare Interrupt Enable bit Position */
#define QEI_QEISTAT_PCLEQIEN_Msk              (_UINT32_(0x1) << QEI_QEISTAT_PCLEQIEN_Pos)          /* (QEI_QEISTAT) Position Counter Less Than or Equal Compare Interrupt Enable bit Mask */
#define QEI_QEISTAT_PCLEQIEN(value)           (QEI_QEISTAT_PCLEQIEN_Msk & (_UINT32_(value) << QEI_QEISTAT_PCLEQIEN_Pos)) /* Assignment of value for PCLEQIEN in the QEI_QEISTAT register */
#define   QEI_QEISTAT_PCLEQIEN_ON_Val         _UINT32_(0x1)                                        /* (QEI_QEISTAT) Interrupt is enabled  */
#define   QEI_QEISTAT_PCLEQIEN_OFF_Val        _UINT32_(0x0)                                        /* (QEI_QEISTAT) Interrupt is disabled  */
#define QEI_QEISTAT_PCLEQIEN_ON               (QEI_QEISTAT_PCLEQIEN_ON_Val << QEI_QEISTAT_PCLEQIEN_Pos) /* (QEI_QEISTAT) Interrupt is enabled Position */
#define QEI_QEISTAT_PCLEQIEN_OFF              (QEI_QEISTAT_PCLEQIEN_OFF_Val << QEI_QEISTAT_PCLEQIEN_Pos) /* (QEI_QEISTAT) Interrupt is disabled Position */
#define QEI_QEISTAT_PCLEQIRQ_Pos              _UINT32_(11)                                         /* (QEI_QEISTAT) Position Counter Less Than or Equal Compare Status bit Position */
#define QEI_QEISTAT_PCLEQIRQ_Msk              (_UINT32_(0x1) << QEI_QEISTAT_PCLEQIRQ_Pos)          /* (QEI_QEISTAT) Position Counter Less Than or Equal Compare Status bit Mask */
#define QEI_QEISTAT_PCLEQIRQ(value)           (QEI_QEISTAT_PCLEQIRQ_Msk & (_UINT32_(value) << QEI_QEISTAT_PCLEQIRQ_Pos)) /* Assignment of value for PCLEQIRQ in the QEI_QEISTAT register */
#define   QEI_QEISTAT_PCLEQIRQ_LESS_EQUAL_Val _UINT32_(0x1)                                        /* (QEI_QEISTAT) POSxCNT less than or equal to QEICMPL  */
#define   QEI_QEISTAT_PCLEQIRQ_GREATER_Val    _UINT32_(0x0)                                        /* (QEI_QEISTAT) POSxCNT greater than QEICMPL  */
#define QEI_QEISTAT_PCLEQIRQ_LESS_EQUAL       (QEI_QEISTAT_PCLEQIRQ_LESS_EQUAL_Val << QEI_QEISTAT_PCLEQIRQ_Pos) /* (QEI_QEISTAT) POSxCNT less than or equal to QEICMPL Position */
#define QEI_QEISTAT_PCLEQIRQ_GREATER          (QEI_QEISTAT_PCLEQIRQ_GREATER_Val << QEI_QEISTAT_PCLEQIRQ_Pos) /* (QEI_QEISTAT) POSxCNT greater than QEICMPL Position */
#define QEI_QEISTAT_PCHEQIEN_Pos              _UINT32_(12)                                         /* (QEI_QEISTAT) Position Counter Greater Than or Equal Compare Interrupt Enable bit Position */
#define QEI_QEISTAT_PCHEQIEN_Msk              (_UINT32_(0x1) << QEI_QEISTAT_PCHEQIEN_Pos)          /* (QEI_QEISTAT) Position Counter Greater Than or Equal Compare Interrupt Enable bit Mask */
#define QEI_QEISTAT_PCHEQIEN(value)           (QEI_QEISTAT_PCHEQIEN_Msk & (_UINT32_(value) << QEI_QEISTAT_PCHEQIEN_Pos)) /* Assignment of value for PCHEQIEN in the QEI_QEISTAT register */
#define   QEI_QEISTAT_PCHEQIEN_ON_Val         _UINT32_(0x1)                                        /* (QEI_QEISTAT) Interrupt is enabled  */
#define   QEI_QEISTAT_PCHEQIEN_OFF_Val        _UINT32_(0x0)                                        /* (QEI_QEISTAT) Interrupt is disabled  */
#define QEI_QEISTAT_PCHEQIEN_ON               (QEI_QEISTAT_PCHEQIEN_ON_Val << QEI_QEISTAT_PCHEQIEN_Pos) /* (QEI_QEISTAT) Interrupt is enabled Position */
#define QEI_QEISTAT_PCHEQIEN_OFF              (QEI_QEISTAT_PCHEQIEN_OFF_Val << QEI_QEISTAT_PCHEQIEN_Pos) /* (QEI_QEISTAT) Interrupt is disabled Position */
#define QEI_QEISTAT_PCHEQIRQ_Pos              _UINT32_(13)                                         /* (QEI_QEISTAT) Position Counter Greater Than or Equal Compare Status bit Position */
#define QEI_QEISTAT_PCHEQIRQ_Msk              (_UINT32_(0x1) << QEI_QEISTAT_PCHEQIRQ_Pos)          /* (QEI_QEISTAT) Position Counter Greater Than or Equal Compare Status bit Mask */
#define QEI_QEISTAT_PCHEQIRQ(value)           (QEI_QEISTAT_PCHEQIRQ_Msk & (_UINT32_(value) << QEI_QEISTAT_PCHEQIRQ_Pos)) /* Assignment of value for PCHEQIRQ in the QEI_QEISTAT register */
#define   QEI_QEISTAT_PCHEQIRQ_MORE_EQUAL_Val _UINT32_(0x1)                                        /* (QEI_QEISTAT) POSxCNT greater than or equal to QEIICCH  */
#define   QEI_QEISTAT_PCHEQIRQ_LESS_Val       _UINT32_(0x0)                                        /* (QEI_QEISTAT) POSxCNT less than QEIICCH  */
#define QEI_QEISTAT_PCHEQIRQ_MORE_EQUAL       (QEI_QEISTAT_PCHEQIRQ_MORE_EQUAL_Val << QEI_QEISTAT_PCHEQIRQ_Pos) /* (QEI_QEISTAT) POSxCNT greater than or equal to QEIICCH Position */
#define QEI_QEISTAT_PCHEQIRQ_LESS             (QEI_QEISTAT_PCHEQIRQ_LESS_Val << QEI_QEISTAT_PCHEQIRQ_Pos) /* (QEI_QEISTAT) POSxCNT less than QEIICCH Position */
#define QEI_QEISTAT_Msk                       _UINT32_(0x00003FFF)                                 /* (QEI_QEISTAT) Register Mask  */


/* -------- QEI_QEISTATCLR : (QEI Offset: 0x24) (R/W 32) Bit clear register -------- */
#define QEI_QEISTATCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_QEISTATCLR) Bit clear register  Reset Value */

